{
  "backend/main.mo": "Defines data types and in-memory maps for tasks, overtime, user profiles, dental avatars, and legacy decision entries. Initializes default avatars and tracks IDs for task and overtime entries.",
  "feature_evidence.json": "Feature evidence metadata mapping frontend files, components, and test IDs to two task‑reset related features. Serves as a structured record for feature coverage and confidence.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries of numerous frontend components, hooks, and pages for documentation or build planning.",
  "frontend/index.css": "Defines Tailwind layers and extensive light/dark theme CSS variables using OKLCH values, applying global background and border styling.",
  "frontend/index.html": "Minimal HTML entrypoint with root mounting div and script loading the React main.tsx module.",
  "frontend/src/App.tsx": "Main app component handling authentication initialization and conditional rendering of login or authenticated flows with theme and i18n providers.",
  "frontend/src/components/auth/AuthenticatedAppFlow.tsx": "Controls post-login flow by loading user role and profile, showing role choice or onboarding when needed, and rendering the main app shell otherwise.",
  "frontend/src/components/auth/FirstManagerConfirmDialog.tsx": "Empty file placeholder for a manager confirmation dialog component.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login UI allowing selection of assistant or manager role with optional manager token, storing selections before triggering Internet Identity login.",
  "frontend/src/components/auth/RoleChoiceScreen.tsx": "Role selection UI letting users choose assistant or manager, handling persisted choices and token entry before calling role selection mutations.",
  "frontend/src/components/avatars/avatarManifest.ts": "Empty file placeholder for avatar manifest data.",
  "frontend/src/components/avatars/AvatarPicker.tsx": "Fetches and displays selectable dental avatars with loading, error, and empty states.",
  "frontend/src/components/avatars/DentalAvatarImage.tsx": "Renders a dental avatar SVG or a fallback if invalid or loading fails, using data URI encoding.",
  "frontend/src/components/avatars/GeneratedDentalAvatar.tsx": "Generates a pastel-colored SVG avatar displaying up to three initials.",
  "frontend/src/components/avatars/ProfileAvatar.tsx": "Chooses between uploaded profile photo, dental avatar, or generated initials avatar based on availability.",
  "frontend/src/components/badges/badges.ts": "Defines badge metadata including IDs, translation keys, and icons.",
  "frontend/src/components/badges/BadgeShelf.tsx": "Side sheet showing all badges with earned state indicators using translations.",
  "frontend/src/components/common/QueryErrorFallback.tsx": "Full-page error fallback showing an error message and retry button.",
  "frontend/src/components/layout/AppHeader.tsx": "Application header with logo, theme and language controls, profile menu, badge and settings panels, and logout handling.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with header, tab navigation, conditional manager tab, and footer.",
  "frontend/src/components/layout/LanguageSelector.tsx": "Dropdown selector to change application language among predefined options.",
  "frontend/src/components/layout/ThemeToggle.tsx": "Button toggling between light and dark themes using next-themes.",
  "frontend/src/components/manager/TaskAuditLog.tsx": "Displays a table of completed tasks with user info, comments, and photo indicators using profile lookup.",
  "frontend/src/components/manager/TaskCompletionChart.tsx": "Generates a bar chart summarizing task completions per user based on completed task data.",
  "frontend/src/components/manager/UserPicker.tsx": "Renders a dropdown for selecting a user, showing avatars and usernames, and returns the chosen Principal.",
  "frontend/src/components/navigation/TabNav.tsx": "Simple tab navigation bar that switches active tabs via callback.",
  "frontend/src/components/overtime/OvertimeForm.tsx": "Form for adding or deducting overtime minutes with date validation and submission handling.",
  "frontend/src/components/overtime/OvertimeHistory.tsx": "Shows a sorted list of overtime entries with date formatting and visual indicators for additions or deductions.",
  "frontend/src/components/overtime/OvertimeTotals.tsx": "Calculates and displays total overtime minutes and a formatted composite of days, hours, and minutes.",
  "frontend/src/components/profile/PrivacyPanel.tsx": "Panel for exporting cached user data or clearing local profile data with confirmation prompts.",
  "frontend/src/components/profile/ProfileOnboardingModal.tsx": "Modal for initial profile setup allowing username, initials, avatar selection, and photo upload with progress tracking and saving.",
  "frontend/src/components/profile/ProfilePhotoField.tsx": "Photo upload field with validation, preview, remove option, and upload progress display.",
  "frontend/src/components/profile/ProfileSettingsPanel.tsx": "Profile settings sheet enabling editing of username, initials, avatar mode, photo upload/removal, and privacy panel access.",
  "frontend/src/components/tasks/CompleteTaskDialog.tsx": "Dialog for completing a task with optional comment and before/after photo uploads before submitting.",
  "frontend/src/components/tasks/CreateTaskDialog.tsx": "Dialog for creating a new task by entering title, description, and selecting task type.",
  "frontend/src/components/tasks/TaskCard.tsx": "Displays a task with type badges, completion state, and optionally opens a dialog to mark it completed.",
  "frontend/src/components/tasks/TaskList.tsx": "Sorts and displays tasks by completion and priority, showing a message if none exist.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks to fetch the caller’s user role and admin status from the backend.",
  "frontend/src/hooks/useBadges.ts": "Computes earned badges from overtime and task completion data.",
  "frontend/src/hooks/useDentalAvatars.ts": "Fetches dental avatars from the backend and provides a lookup helper.",
  "frontend/src/hooks/useI18n.ts": "Returns the i18n context or throws if missing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity auth state, login, logout, and identity loading.",
  "frontend/src/hooks/useManagerOvertime.ts": "Fetches a user's overtime entries and formats them for export.",
  "frontend/src/hooks/useManagerTasks.ts": "Provides a disabled-by-default query to export task data.",
  "frontend/src/hooks/useNotify.ts": "Provides toast helpers and standardized error handling based on message patterns.",
  "frontend/src/hooks/useOvertime.ts": "Fetches caller overtime entries and provides mutation to create new entries with cache updates.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that feature-specific hooks live elsewhere.",
  "frontend/src/hooks/useRoleSelection.ts": "Provides mutations for selecting assistant or manager roles and updates role-related queries.",
  "frontend/src/hooks/useTasks.ts": "Manages task fetching and mutations for creating, completing, and resetting tasks with optimistic updates.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches, updates, and manages user profile data including photo upload/removal.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides a React context for language selection and translation lookup with persistence in localStorage.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and a large object containing translation strings for the UI.",
  "frontend/src/index.css": "Configures Tailwind layers, theme variables, dark mode colors, and global base styles including animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider, and loads global styles.",
  "frontend/src/pages/manager/ManagerDashboard.tsx": "Renders the manager dashboard with tabs for overtime management and statistics.",
  "frontend/src/pages/manager/ManagerOvertimePage.tsx": "Allows managers to view user overtime entries, export data to CSV, and select users to inspect.",
  "frontend/src/pages/manager/ManagerStatsPage.tsx": "Shows task statistics, audit logs, and provides CSV export of task data using actor calls.",
  "frontend/src/pages/OvertimePage.tsx": "Displays overtime form, totals, and history, fetching user overtime entries and showing a loading state.",
  "frontend/src/pages/TasksPage.tsx": "Shows the task list with creation dialog, resets recurring tasks on initial load, and handles loading state.",
  "frontend/src/utils/csv.ts": "Converts arrays of objects to a CSV file and triggers a client-side download.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL and session-stored parameters, persisting them, and manipulating hash params.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom OKLCH color system, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata detailing app requirements, architecture notes, known issues, and feature definitions for the FitGebit Team Tracker ICP app."
}