{
  "backend/main.mo": "Main Motoko actor implementing user profiles, shared tasks with photos, access control, and legacy decision types with migration hook.",
  "backend/migration.mo": "Migration module converting old task and actor data to the new shared-task model while dropping obsolete overtime fields.",
  "feature_evidence.json": "Feature evidence report listing updated frontend files, components, and test IDs for overtime removal and task redesign features.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend components, hooks, and pages reflecting task redesign and removed overtime features.",
  "frontend/index.css": "Tailwind base styles and OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "Root HTML file mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, role setup, profile onboarding, and rendering the app shell.",
  "frontend/src/components/auth/FirstManagerConfirmDialog.tsx": "Dialog prompting initial managers to confirm role setup and triggering backend role assignment.",
  "frontend/src/components/auth/LoginScreen.tsx": "Displays a login screen with branding, prompting users to sign in via Internet Identity.",
  "frontend/src/components/avatars/avatarManifest.ts": "Exports a list of avatar metadata and a helper to resolve an avatar image path by ID.",
  "frontend/src/components/avatars/AvatarPicker.tsx": "Provides a paginated grid UI for selecting an avatar from the avatar manifest.",
  "frontend/src/components/badges/badges.ts": "Defines the static list of badge IDs, translation keys, and icons.",
  "frontend/src/components/badges/BadgeShelf.tsx": "Shows all badges in a sheet, highlighting which ones the user has earned.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the main header with branding, user menu, settings, badges, theme toggle, and language selector.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the main app layout with header, tabs, page routing, and footer.",
  "frontend/src/components/layout/LanguageSelector.tsx": "Dropdown control for switching the app’s active language.",
  "frontend/src/components/layout/ThemeToggle.tsx": "Button to toggle between light and dark themes.",
  "frontend/src/components/manager/TaskAuditLog.tsx": "Displays a table listing completed tasks with user info, comments, and photo indicators.",
  "frontend/src/components/manager/TaskCompletionChart.tsx": "Generates a bar chart summarizing number of completed tasks per user.",
  "frontend/src/components/manager/UserPicker.tsx": "Renders a dropdown for selecting a user by principal, showing avatars and usernames. Calls back with the chosen Principal or null.",
  "frontend/src/components/navigation/TabNav.tsx": "Displays a horizontal tab bar and triggers tab changes when buttons are clicked. Highlights the active tab.",
  "frontend/src/components/overtime/OvertimeForm.tsx": "Form for entering overtime minutes, date, and comments with validation. Submission is disabled because backend overtime functionality is unavailable.",
  "frontend/src/components/overtime/OvertimeHistory.tsx": "Shows a sorted list of overtime entries with date, minutes, and visual indicators for additions or subtractions. Displays a placeholder when no entries exist.",
  "frontend/src/components/overtime/OvertimeTotals.tsx": "Calculates total overtime minutes and converts them into workdays plus remaining minutes. Displays totals in styled info cards.",
  "frontend/src/components/profile/PrivacyPanel.tsx": "Provides data export and local profile deletion options using a sheet UI. Clears cached data and logs out on delete.",
  "frontend/src/components/profile/ProfileOnboardingModal.tsx": "Modal shown on first use to collect username, initials, and avatar before saving a new user profile. Determines role based on current user’s authz status.",
  "frontend/src/components/profile/ProfileSettingsPanel.tsx": "Settings panel allowing profile edits and avatar changes, with access to a privacy submenu. Saves updates to the caller’s user profile.",
  "frontend/src/components/tasks/CompleteTaskDialog.tsx": "Dialog for completing a task with optional comment and before/after photos, submitting data via useCompleteTask.",
  "frontend/src/components/tasks/CreateTaskDialog.tsx": "Dialog for creating a task with title and type selection, submitting via useCreateTask.",
  "frontend/src/components/tasks/TaskCard.tsx": "Displays task details, status, badges, and allows marking tasks as complete through a dialog.",
  "frontend/src/components/tasks/TaskList.tsx": "Sorts and lists tasks by completion and priority, rendering each with TaskCard.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on user identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks to fetch caller's user role and admin status via the actor.",
  "frontend/src/hooks/useBadges.ts": "Computes earned badges based on overtime entries and completed tasks.",
  "frontend/src/hooks/useI18n.ts": "Returns the i18n context for localization, requiring use within I18nProvider.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, and stored identities via AuthClient.",
  "frontend/src/hooks/useManagerOvertime.ts": "Empty placeholder file for manager overtime hooks.",
  "frontend/src/hooks/useManagerTasks.ts": "Provides a hook to export task data using the actor, disabled by default.",
  "frontend/src/hooks/useNotify.ts": "Wrapper around toast notifications with localized success, error, and auto-mapped error handling.",
  "frontend/src/hooks/useOvertime.ts": "Legacy overtime hooks returning empty data or errors since overtime was removed from backend.",
  "frontend/src/hooks/useQueries.ts": "Minimal placeholder noting queries are split into feature-specific hooks.",
  "frontend/src/hooks/useTasks.ts": "Provides React Query hooks for fetching, creating, completing, and resetting tasks using the backend actor, with automatic cache invalidation.",
  "frontend/src/hooks/useUserProfile.ts": "Contains hooks to fetch and update user profiles via the actor, including current user, specific user, and all profiles.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements an i18n context with language persistence and a translation lookup function.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and nested translation dictionaries for UI text.",
  "frontend/src/index.css": "Tailwind CSS setup with custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and Internet Identity providers and loads global styles.",
  "frontend/src/pages/manager/ManagerDashboard.tsx": "Provides tabbed navigation for manager-specific overtime and statistics pages.",
  "frontend/src/pages/manager/ManagerOvertimePage.tsx": "Allows managers to select users and view overtime sections, with CSV export disabled due to missing backend support.",
  "frontend/src/pages/manager/ManagerStatsPage.tsx": "Displays task statistics and audit log and supports CSV export of task data via the actor.",
  "frontend/src/pages/OvertimePage.tsx": "Displays overtime form, totals, and history, handling loading state via React Query.",
  "frontend/src/pages/TasksPage.tsx": "Shows task list, triggers recurring task resets on mount, and provides task creation UI.",
  "frontend/src/utils/csv.ts": "Exports arrays of objects to downloadable CSV files with proper escaping.",
  "frontend/src/utils/urlParams.ts": "Helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing app requirements, architecture notes, known issues, and existing feature definitions for the FitGebit Team Tracker update."
}