{
  "backend/main.mo": "Defines data types and in-memory storage for profiles, tasks, overtime, decisions, and dental avatars within the main Motoko canister actor.",
  "feature_evidence.json": "Lists feature evidence entries mapping UI changes to specific frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend components, hooks, and pages for reference.",
  "frontend/index.css": "Sets Tailwind base styles and defines extensive OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx with a root div.",
  "frontend/src/App.tsx": "Controls authentication flow using Internet Identity and renders either loading, login, or the authenticated app UI.",
  "frontend/src/components/auth/AuthenticatedAppFlow.tsx": "Determines post-login routing based on user role and profile state, handling loading and error states.",
  "frontend/src/components/auth/FirstManagerConfirmDialog.tsx": "Empty placeholder file for a first‑manager confirmation dialog.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen allowing assistants or managers to select a role, optionally enter a manager token, and proceed with Internet Identity login.",
  "frontend/src/components/auth/RoleChoiceScreen.tsx": "UI for selecting assistant or manager role with optional manager token and persisted pending selections.",
  "frontend/src/components/avatars/avatarManifest.ts": "Empty placeholder file for avatar manifest.",
  "frontend/src/components/avatars/AvatarPicker.tsx": "Displays selectable dental avatars with loading, error, and empty states.",
  "frontend/src/components/avatars/DentalAvatarImage.tsx": "Renders an SVG dental avatar or a fallback if missing/invalid, using data URIs and error handling.",
  "frontend/src/components/avatars/GeneratedDentalAvatar.tsx": "Generates a pastel-colored SVG avatar showing initials with a tooth motif.",
  "frontend/src/components/avatars/ProfileAvatar.tsx": "Chooses between uploaded photo, dental avatar, or generated initials avatar for user display.",
  "frontend/src/components/badges/badges.ts": "Defines static badge metadata including IDs, translation keys, and icons.",
  "frontend/src/components/badges/BadgeShelf.tsx": "Shows all badges in a sheet, marking earned ones and supporting translations.",
  "frontend/src/components/common/QueryErrorFallback.tsx": "Full‑screen error fallback with message, details, and retry button.",
  "frontend/src/components/layout/AppHeader.tsx": "Top app header with logo, theme/language controls, profile menu, settings, badges, and logout.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout container with header, tab navigation, routed pages, and footer.",
  "frontend/src/components/layout/LanguageSelector.tsx": "Dropdown to switch between supported UI languages.",
  "frontend/src/components/layout/ThemeToggle.tsx": "Button to toggle between light and dark themes using next-themes.",
  "frontend/src/components/manager/TaskAuditLog.tsx": "Displays a table of completed tasks with user info, comments, and before/after photos.",
  "frontend/src/components/manager/TaskCompletionChart.tsx": "Generates a bar chart showing how many tasks each user has completed.",
  "frontend/src/components/manager/UserPicker.tsx": "Renders a user dropdown selector with avatars and triggers selection changes.",
  "frontend/src/components/navigation/TabNav.tsx": "Simple horizontal tab navigation component highlighting the active tab.",
  "frontend/src/components/overtime/OvertimeDatePickerField.tsx": "Custom date input field combining manual inputs with a hidden native date picker enforcing a 2‑month range.",
  "frontend/src/components/overtime/OvertimeForm.tsx": "Form for adding or deducting overtime minutes with validation and submission to backend.",
  "frontend/src/components/overtime/OvertimeHistory.tsx": "Shows a sorted list of overtime entries, color‑coded based on addition or deduction.",
  "frontend/src/components/overtime/OvertimeTotals.tsx": "Calculates and displays total overtime in minutes and formatted days/hours/minutes.",
  "frontend/src/components/profile/PrivacyPanel.tsx": "Privacy settings panel allowing data export, logout, and local data deletion.",
  "frontend/src/components/profile/ProfileOnboardingModal.tsx": "Modal for initial profile setup allowing username, initials, avatar selection, and optional photo upload, then saving via profile API hooks.",
  "frontend/src/components/profile/ProfilePhotoField.tsx": "Component for selecting, previewing, validating, and removing a profile photo with optional upload progress display.",
  "frontend/src/components/profile/ProfileSettingsPanel.tsx": "Profile settings sheet enabling editing of username, initials, avatar or photo, with upload/remove photo logic and privacy panel access.",
  "frontend/src/components/tasks/CompleteTaskDialog.tsx": "Dialog for marking a task complete with comment and optional before/after photos uploaded as blobs.",
  "frontend/src/components/tasks/CreateTaskDialog.tsx": "Dialog for creating a new task with title, description, and type selection, then submitting via task creation API.",
  "frontend/src/components/tasks/TaskCard.tsx": "Task card displaying task details, completion status, and actions to complete or reset the task, with dynamic styling by type.",
  "frontend/src/components/tasks/TaskList.tsx": "Renders a sorted list of tasks, placing completed tasks last and ordering by task type priority, with fallback UI when empty.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks to fetch the caller's user role and admin status using the backend actor.",
  "frontend/src/hooks/useBadges.ts": "Computes earned badges based on overtime entries and completed tasks.",
  "frontend/src/hooks/useDentalAvatars.ts": "Fetches dental avatars from the backend and offers a lookup helper by avatar ID.",
  "frontend/src/hooks/useI18n.ts": "Returns the i18n context for translations and ensures usage within the provider.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, and identity persistence.",
  "frontend/src/hooks/useManagerOvertime.ts": "Fetches overtime entries for a specific user and provides a helper to format entries for export.",
  "frontend/src/hooks/useManagerTasks.ts": "Exposes a query to export all task data from the backend.",
  "frontend/src/hooks/useNotify.ts": "Wraps toast notifications and normalizes common backend error messages.",
  "frontend/src/hooks/useOvertime.ts": "Handles fetching and creating caller overtime entries with cache updates.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that feature-specific hooks live elsewhere.",
  "frontend/src/hooks/useRoleSelection.ts": "Allows selecting assistant or manager roles and updates related authorization queries.",
  "frontend/src/hooks/useTasks.ts": "Provides task CRUD operations with optimistic updates and special handling for obsolete weekly tasks.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and mutates user profile data, including photos, with cache invalidation.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides a React context for language selection and translation lookup with persistence in localStorage.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and a nested translations object for UI text.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, color variables, dark mode values, and adds a float animation.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/manager/ManagerDashboard.tsx": "Renders manager dashboard with tab navigation for overtime management and task statistics.",
  "frontend/src/pages/manager/ManagerOvertimePage.tsx": "Allows managers to view a user's overtime data, export CSV, and browse totals and history.",
  "frontend/src/pages/manager/ManagerStatsPage.tsx": "Shows task statistics and audit logs and allows exporting task data to CSV.",
  "frontend/src/pages/OvertimePage.tsx": "Displays overtime form, totals, and history, loading entries and showing a spinner when needed.",
  "frontend/src/pages/TasksPage.tsx": "Shows tasks with create dialog and resets recurring tasks when due, handling loading and user profile checks.",
  "frontend/src/utils/csv.ts": "Exports an array of objects to a CSV file with proper escaping and file download handling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters with hash support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom color palette using CSS variables, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's current feature requirements, architectural notes, and known issues for the FitGebit Team Tracker app, including authentication, roles, avatars, tasks, and overtime logic."
}