{
  "backend/main.mo": "Defines actor data models for profiles, tasks, overtime, decisions, and initializes storage maps and avatar defaults.",
  "feature_evidence.json": "Lists feature evidence entries linking feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of various frontend component and hook files for reference.",
  "frontend/index.css": "Tailwind base setup with theme color variables for light and dark modes and global styling rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level app that handles authentication flow, loading state, and theme/i18n providers.",
  "frontend/src/components/auth/AuthenticatedAppFlow.tsx": "Controls authenticated user flow including role retrieval, profile onboarding, and app shell rendering.",
  "frontend/src/components/auth/FirstManagerConfirmDialog.tsx": "Empty placeholder file for a first-manager confirmation dialog.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen letting users choose assistant or manager role, optionally enter a manager token, and initiate Internet Identity login.",
  "frontend/src/components/auth/RoleChoiceScreen.tsx": "UI for selecting assistant or manager role, handling session-persisted selections and triggering role selection mutations.",
  "frontend/src/components/avatars/avatarManifest.ts": "Empty placeholder file for avatar manifest data.",
  "frontend/src/components/avatars/AvatarPicker.tsx": "Displays a selectable grid of dental avatars with loading, error, and empty states.",
  "frontend/src/components/avatars/DentalAvatarImage.tsx": "Renders an SVG dental avatar or a fallback if missing or invalid, using data URIs and error handling.",
  "frontend/src/components/avatars/GeneratedDentalAvatar.tsx": "Generates a pastel-colored circular SVG avatar displaying user initials.",
  "frontend/src/components/avatars/ProfileAvatar.tsx": "Chooses between uploaded photo, dental avatar, or generated initials avatar based on priority.",
  "frontend/src/components/badges/badges.ts": "Defines the static list of badge metadata including IDs, translation keys, and icons.",
  "frontend/src/components/badges/BadgeShelf.tsx": "Side panel listing all badges, highlighting earned ones with translations and UI styling.",
  "frontend/src/components/common/QueryErrorFallback.tsx": "Full-screen fallback UI showing an error message with a retry button.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation header with logo, theme/language controls, user menu, profile avatar, and badge/settings access.",
  "frontend/src/components/layout/AppShell.tsx": "Main application wrapper providing header, tab navigation, page rendering, and footer.",
  "frontend/src/components/layout/LanguageSelector.tsx": "Dropdown allowing users to switch between supported languages.",
  "frontend/src/components/layout/ThemeToggle.tsx": "Button toggling between light and dark themes using next-themes.",
  "frontend/src/components/manager/TaskAuditLog.tsx": "Displays a table of completed tasks with user, type, comments, and photo indicators using profile lookup.",
  "frontend/src/components/manager/TaskCompletionChart.tsx": "Builds a bar chart showing number of completed tasks per user based on task data.",
  "frontend/src/components/manager/UserPicker.tsx": "Renders a dropdown for selecting a user, showing avatars and usernames, and returns the selected Principal.",
  "frontend/src/components/navigation/TabNav.tsx": "Provides a simple tab bar UI that switches active tabs through callbacks.",
  "frontend/src/components/overtime/OvertimeForm.tsx": "Form for creating overtime entries with validation, date inputs, and add/deduct logic.",
  "frontend/src/components/overtime/OvertimeHistory.tsx": "Lists overtime entries sorted by date, showing signed minutes and formatted dates.",
  "frontend/src/components/overtime/OvertimeTotals.tsx": "Calculates and displays total overtime minutes and a composite day/hour/minute breakdown.",
  "frontend/src/components/profile/PrivacyPanel.tsx": "Provides data export and local data deletion options within a settings panel using cached query data.",
  "frontend/src/components/profile/ProfileOnboardingModal.tsx": "Modal for initial profile setup, allowing username, initials, avatar selection, and optional photo upload with progress tracking.",
  "frontend/src/components/profile/ProfilePhotoField.tsx": "Component for selecting, previewing, validating, and removing a profile photo with optional upload progress display.",
  "frontend/src/components/profile/ProfileSettingsPanel.tsx": "Slide-in panel for editing an existing profile, managing avatars, uploading or removing profile photos, and accessing privacy settings.",
  "frontend/src/components/tasks/CompleteTaskDialog.tsx": "Dialog for completing a task with optional comment and before/after photos that are converted into blobs before submission.",
  "frontend/src/components/tasks/CreateTaskDialog.tsx": "Dialog for creating a new task with title, description, and task type selection.",
  "frontend/src/components/tasks/TaskCard.tsx": "Card displaying task details, status, and actions such as completing or resetting tasks with visual indicators.",
  "frontend/src/components/tasks/TaskList.tsx": "Sorts and displays tasks with completed items last and type priority; renders TaskCard list or empty state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks to fetch caller user role and admin status using the actor.",
  "frontend/src/hooks/useBadges.ts": "Computes earned badges based on overtime entries and completed tasks.",
  "frontend/src/hooks/useDentalAvatars.ts": "Fetches all dental avatars from the backend and provides lookup by ID.",
  "frontend/src/hooks/useI18n.ts": "Returns i18n context for translations, throwing if provider is missing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, identity loading, and context access.",
  "frontend/src/hooks/useManagerOvertime.ts": "Fetches overtime entries for a specific user and prepares export-friendly data.",
  "frontend/src/hooks/useManagerTasks.ts": "Retrieves task data for export through the backend actor.",
  "frontend/src/hooks/useNotify.ts": "Provides toast-based success, error, info notifications and standardized error handling.",
  "frontend/src/hooks/useOvertime.ts": "Gets caller overtime entries and allows creating new entries with cache updates.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting shared query patterns; main logic lives in specialized hooks.",
  "frontend/src/hooks/useRoleSelection.ts": "Handles selecting assistant or manager roles and invalidates related auth queries.",
  "frontend/src/hooks/useTasks.ts": "Fetches tasks and supports creating, completing, resetting, and auto-retrying weekly tasks.",
  "frontend/src/hooks/useUserProfile.ts": "Manages fetching, saving, and updating caller and user profiles including photo uploads.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides a React context for language selection and translation lookup with localStorage persistence.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and translation dictionaries for UI strings.",
  "frontend/src/index.css": "Configures Tailwind base styles, CSS variables for themes, and utility animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/manager/ManagerDashboard.tsx": "Provides tabbed manager dashboard switching between overtime and stats views.",
  "frontend/src/pages/manager/ManagerOvertimePage.tsx": "Allows managers to view user overtime, pick users, and export overtime data to CSV.",
  "frontend/src/pages/manager/ManagerStatsPage.tsx": "Shows task statistics and audit logs and allows managers to export task data.",
  "frontend/src/pages/OvertimePage.tsx": "Displays overtime form, totals, and history, loading entries via a hook.",
  "frontend/src/pages/TasksPage.tsx": "Shows task list and creation dialog, and auto-resets recurring tasks when due.",
  "frontend/src/utils/csv.ts": "Exports arrays of objects to CSV files with proper escaping.",
  "frontend/src/utils/urlParams.ts": "Utility functions for handling URL parameters and session-based persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, content scanning, extended color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing ICP app requirements, architecture notes, and known issues for FitGebit Team Tracker, including role logic, avatars, tasks, and overtime bugs."
}