{
  "backend/main.mo": "Defines core backend data models for users, tasks, overtime, and dental avatars, along with state maps and defaults.",
  "backend/migration.mo": "Provides a migration that adds a description field to tasks by transforming old state into a new actor state.",
  "feature_evidence.json": "Feature evidence report linking features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend components and hooks used across the app.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Top-level app component handling auth initialization, login, and authenticated app flow rendering.",
  "frontend/src/components/auth/AuthenticatedAppFlow.tsx": "Controls post‑login flow based on user role and profile status, including error and loading states.",
  "frontend/src/components/auth/FirstManagerConfirmDialog.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login UI allowing assistant or manager selection, storing role and token before initiating authentication.",
  "frontend/src/components/auth/RoleChoiceScreen.tsx": "Post-auth role selection screen that reads pending role data and triggers assistant or manager selection mutations.",
  "frontend/src/components/avatars/avatarManifest.ts": "Empty placeholder file for avatar manifest data.",
  "frontend/src/components/avatars/AvatarPicker.tsx": "Displays dental avatars with loading/error states and allows selecting an avatar ID.",
  "frontend/src/components/avatars/DentalAvatarImage.tsx": "Renders an SVG dental avatar or a fallback image if missing or invalid.",
  "frontend/src/components/avatars/GeneratedDentalAvatar.tsx": "Generates a pastel-colored SVG avatar based on user initials.",
  "frontend/src/components/avatars/ProfileAvatar.tsx": "Chooses between uploaded photo, dental avatar, or generated initials avatar based on available data.",
  "frontend/src/components/badges/badges.ts": "Defines static metadata for all available badges.",
  "frontend/src/components/badges/BadgeShelf.tsx": "Displays all badges in a sheet, marking which ones are earned.",
  "frontend/src/components/common/QueryErrorFallback.tsx": "Full-screen error fallback showing an error message and retry button.",
  "frontend/src/components/layout/AppHeader.tsx": "Top app header showing logo, profile info, theme/language controls, and menus for settings, badges, and logout.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main application layout with header, tabs, and conditional rendering of tasks, overtime, and manager pages based on active tab and admin status.",
  "frontend/src/components/layout/LanguageSelector.tsx": "Renders a dropdown for selecting the UI language and updates the current language via i18n.",
  "frontend/src/components/layout/ThemeToggle.tsx": "A button that toggles between light and dark themes using next-themes.",
  "frontend/src/components/manager/TaskAuditLog.tsx": "Displays a table of completed tasks with user, type, comments, and photo indicators, built from task and profile data.",
  "frontend/src/components/manager/TaskCompletionChart.tsx": "Generates a bar chart showing how many tasks each user has completed using Recharts.",
  "frontend/src/components/manager/UserPicker.tsx": "Provides a dropdown to select a user, showing avatars and usernames from profile data.",
  "frontend/src/components/navigation/TabNav.tsx": "Simple tab navigation bar that highlights the active tab and triggers tab changes.",
  "frontend/src/components/overtime/OvertimeForm.tsx": "Form for adding or deducting overtime minutes with validation and mutation submission.",
  "frontend/src/components/overtime/OvertimeHistory.tsx": "Shows a chronological list of overtime entries with color‑coded add/deduct indicators and formatted dates.",
  "frontend/src/components/overtime/OvertimeTotals.tsx": "Calculates and displays total overtime minutes and a composite days/hours/minutes breakdown.",
  "frontend/src/components/profile/PrivacyPanel.tsx": "Panel allowing users to export cached data, navigate back, or clear local data and log out via Internet Identity.",
  "frontend/src/components/profile/ProfileOnboardingModal.tsx": "Modal for initial user profile setup with username, initials, avatar selection, and optional photo upload, saving via profile APIs.",
  "frontend/src/components/profile/ProfilePhotoField.tsx": "Reusable photo upload field with preview, validation, removal, and upload progress display.",
  "frontend/src/components/profile/ProfileSettingsPanel.tsx": "Profile settings panel allowing users to edit profile info, switch avatars, manage photos, and save updates.",
  "frontend/src/components/tasks/CompleteTaskDialog.tsx": "Dialog for marking a task complete with optional comment and before/after photo uploads.",
  "frontend/src/components/tasks/CreateTaskDialog.tsx": "Dialog for creating new tasks including title, description, and task type selection.",
  "frontend/src/components/tasks/TaskCard.tsx": "Displays a task card with type badges, description, completion status, and option to mark as complete.",
  "frontend/src/components/tasks/TaskList.tsx": "Renders a sorted list of tasks, prioritizing incomplete and higher‑priority types, and displays fallback text if empty.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides queries to fetch the caller’s user role and admin status using the actor.",
  "frontend/src/hooks/useBadges.ts": "Computes earned badges from overtime entries and completed tasks.",
  "frontend/src/hooks/useDentalAvatars.ts": "Fetches dental avatars from the backend and exposes a lookup helper.",
  "frontend/src/hooks/useI18n.ts": "Returns the i18n context for translations and ensures provider presence.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, stored identities, and provides identity context.",
  "frontend/src/hooks/useManagerOvertime.ts": "Fetches overtime entries for a specific user and provides a helper to format export data.",
  "frontend/src/hooks/useManagerTasks.ts": "Allows managers to fetch all task data for export.",
  "frontend/src/hooks/useNotify.ts": "Provides toast notifications and standardized error handling.",
  "frontend/src/hooks/useOvertime.ts": "Fetches caller overtime entries and provides mutation to create new entries with cache updates.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that feature-specific hooks live elsewhere.",
  "frontend/src/hooks/useRoleSelection.ts": "Provides mutations to select assistant or manager roles and invalidates related queries.",
  "frontend/src/hooks/useTasks.ts": "Fetches tasks and provides create, complete, and reset task mutations with optimistic updates.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and updates user profiles, including photo upload and admin-level profile listing.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides an i18n context with language state, localStorage persistence, and a translation lookup helper.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and translation dictionaries for UI strings.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, theme variables, dark mode values, and a float animation.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/manager/ManagerDashboard.tsx": "Provides a tabbed manager dashboard with overtime management and task statistics views.",
  "frontend/src/pages/manager/ManagerOvertimePage.tsx": "Lets managers view user overtime data, pick users, export entries to CSV, and see totals and history.",
  "frontend/src/pages/manager/ManagerStatsPage.tsx": "Shows task statistics and audit logs and allows exporting full task data to CSV.",
  "frontend/src/pages/OvertimePage.tsx": "Displays overtime form, totals, and history, fetching entries and showing a loading state.",
  "frontend/src/pages/TasksPage.tsx": "Loads tasks, resets recurring tasks on mount, and renders the task list with a create-task dialog.",
  "frontend/src/utils/csv.ts": "Exports an array of objects to a CSV file with proper escaping and browser download handling.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended color system using OKLCH variables, custom animations, and typography/container-query/animate plugins.",
  "project_state.json": "Defines the app’s current ICP-based project state, feature notes, architectural decisions, and a list of known issues requiring fixes."
}