{
  "backend/main.mo": "Defines the backend canister handling tasks, user profiles, dental avatars, access control, and task completion with photo evidence.",
  "feature_evidence.json": "Lists feature reports with associated files, components, tests, and confidence levels for recent app changes.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files describing UI components, hooks, and behaviors.",
  "frontend/index.css": "Tailwind base file defining theme variables, dark mode colors, and global styling rules.",
  "frontend/index.html": "Basic HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Main application component handling authentication flow, role selection, profile onboarding, and rendering the app shell.",
  "frontend/src/components/auth/FirstManagerConfirmDialog.tsx": "Empty placeholder file for the removed manager confirmation dialog.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen allowing role selection and optional manager token input before initiating Internet Identity authentication.",
  "frontend/src/components/auth/RoleChoiceScreen.tsx": "UI for selecting assistant or manager role, handling stored pending selections and triggering role selection mutations.",
  "frontend/src/components/avatars/avatarManifest.ts": "Empty file placeholder for avatar manifest data.",
  "frontend/src/components/avatars/AvatarPicker.tsx": "Renders a grid of selectable dental avatars, handling loading and empty states.",
  "frontend/src/components/avatars/DentalAvatarImage.tsx": "Displays an avatar’s SVG by ID, falling back to a placeholder when unavailable.",
  "frontend/src/components/badges/badges.ts": "Exports badge definitions containing ids, translation keys, and icons.",
  "frontend/src/components/badges/BadgeShelf.tsx": "Slide-out panel listing all badges and marking which have been earned using translations.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation header with user menu, avatar, settings, badges, theme toggle, and logout behavior.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout managing tabs, routing between pages, and rendering header and footer.",
  "frontend/src/components/layout/LanguageSelector.tsx": "Dropdown allowing users to switch between supported languages via i18n.",
  "frontend/src/components/layout/ThemeToggle.tsx": "Button for toggling between light and dark themes using next-themes.",
  "frontend/src/components/manager/TaskAuditLog.tsx": "Table showing completed tasks with user details, comments, and photo indicators.",
  "frontend/src/components/manager/TaskCompletionChart.tsx": "Generates a bar chart summarizing number of task completions per user.",
  "frontend/src/components/manager/UserPicker.tsx": "Select component for choosing a user by Principal, displaying usernames and avatars.",
  "frontend/src/components/navigation/TabNav.tsx": "Renders a horizontal tab bar and triggers onTabChange when a tab is clicked.",
  "frontend/src/components/overtime/OvertimeForm.tsx": "Form for adding or subtracting overtime with date validation; backend action currently disabled and shows an error.",
  "frontend/src/components/overtime/OvertimeHistory.tsx": "Displays a sorted list of overtime entries with date, minutes, type, and optional comment.",
  "frontend/src/components/overtime/OvertimeTotals.tsx": "Calculates and shows total overtime minutes and their conversion into workdays with remainder.",
  "frontend/src/components/profile/PrivacyPanel.tsx": "Provides data export and account deletion options by exporting cached data and clearing local identity.",
  "frontend/src/components/profile/ProfileOnboardingModal.tsx": "Onboarding modal for creating a user profile with username, initials, avatar, and role assignment.",
  "frontend/src/components/profile/ProfileSettingsPanel.tsx": "Editable profile settings panel for updating username and avatar, with access to privacy tools.",
  "frontend/src/components/tasks/CompleteTaskDialog.tsx": "Dialog for completing a task including optional comment and before/after photo uploads.",
  "frontend/src/components/tasks/CreateTaskDialog.tsx": "Dialog component for creating a task, handling title/type input and submitting via createTask hook.",
  "frontend/src/components/tasks/TaskCard.tsx": "Displays a task with status, type badges, completion info, and a button to mark completion.",
  "frontend/src/components/tasks/TaskList.tsx": "Sorts tasks by completion and priority, then renders them as TaskCard components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks to fetch the caller’s user role and admin status from the backend.",
  "frontend/src/hooks/useBadges.ts": "Derives earned badges from overtime and task completion counts.",
  "frontend/src/hooks/useDentalAvatars.ts": "Fetches dental avatar data from the backend and provides avatar lookup by ID.",
  "frontend/src/hooks/useI18n.ts": "Returns the i18n context for translations, enforcing provider presence.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence.",
  "frontend/src/hooks/useManagerOvertime.ts": "Empty file placeholder for manager overtime hooks.",
  "frontend/src/hooks/useManagerTasks.ts": "Provides a hook to fetch task export data, disabled by default.",
  "frontend/src/hooks/useNotify.ts": "Wraps toast notifications and normalizes error handling using translations.",
  "frontend/src/hooks/useOvertime.ts": "Stub hooks returning empty overtime data due to removed backend support.",
  "frontend/src/hooks/useQueries.ts": "Minimal placeholder noting that feature-specific hooks live elsewhere.",
  "frontend/src/hooks/useRoleSelection.ts": "Hooks for selecting assistant/manager roles and invalidating related auth queries.",
  "frontend/src/hooks/useTasks.ts": "Task CRUD hooks for fetching, creating, completing, and resetting tasks using the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks to fetch and update user profiles using an actor interface.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements an i18n context provider with language persistence and key‑based translation lookup.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and a nested translations object used for UI text.",
  "frontend/src/index.css": "Sets global Tailwind layers, theme variables, dark mode styles, and utility animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity providers.",
  "frontend/src/pages/manager/ManagerDashboard.tsx": "Provides tabbed navigation between manager overtime and task statistics pages.",
  "frontend/src/pages/manager/ManagerOvertimePage.tsx": "Shows a user picker and overtime sections but disables export and backend overtime functionality.",
  "frontend/src/pages/manager/ManagerStatsPage.tsx": "Displays task statistics and audit logs and supports exporting task data to CSV.",
  "frontend/src/pages/OvertimePage.tsx": "Displays overtime form, totals, and history, showing a loading state while data is fetched.",
  "frontend/src/pages/TasksPage.tsx": "Shows the task list and creation dialog, and resets recurring tasks on mount.",
  "frontend/src/utils/csv.ts": "Exports arrays of objects to CSV files with quoting and download handling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color tokens, animations, and plugin integration for typography, container queries, and animations.",
  "project_state.json": "Defines the app’s current ICP-based project state, requirements, architectural notes, issues, and desired updates including identity login, role flow, and avatar changes."
}