{
  "backend/main.mo": "Defines actor state and data types for tasks, decisions, user profiles, avatars, and overtime, including default dental avatar data structures.",
  "feature_evidence.json": "Feature evidence report linking task‑editing and i18n changes to specific frontend files and components.",
  "frontend-file-summaries.txt": "Lists concise descriptions of many frontend components, hooks, pages, and translation files.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark modes plus global styling rules.",
  "frontend/index.html": "Minimal HTML entry point mounting the root element and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Top-level app deciding between loading screen, login flow, or authenticated app based on identity state.",
  "frontend/src/components/auth/AuthenticatedAppFlow.tsx": "Controls post-login flow: handles role/profile loading, errors, onboarding, and showing the main app shell.",
  "frontend/src/components/auth/FirstManagerConfirmDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login UI letting users choose assistant or manager, optionally provide manager token, and trigger identity login.",
  "frontend/src/components/auth/RoleChoiceScreen.tsx": "UI for choosing assistant or manager role, with token input, persisted pending selections, and submission to role-selection hooks.",
  "frontend/src/components/avatars/avatarManifest.ts": "Empty placeholder file for avatar manifest.",
  "frontend/src/components/avatars/AvatarPicker.tsx": "Loads available dental avatars and displays a selectable grid with loading, error, and empty states.",
  "frontend/src/components/avatars/DentalAvatarImage.tsx": "Renders an SVG avatar from lookup or shows a deterministic fallback when missing or invalid.",
  "frontend/src/components/avatars/GeneratedDentalAvatar.tsx": "Generates a pastel-colored SVG avatar based on initials with a stylized tooth and text.",
  "frontend/src/components/avatars/ProfileAvatar.tsx": "Chooses between profile photo, dental SVG avatar, or generated avatar based on provided props.",
  "frontend/src/components/badges/badges.ts": "Defines the badge interface and a list of static badge definitions with icons and translation keys.",
  "frontend/src/components/badges/BadgeShelf.tsx": "Displays all badges in a sheet, indicating earned status and showing badge details.",
  "frontend/src/components/common/QueryErrorFallback.tsx": "Full-screen fallback showing an error message and retry button for failed queries.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation header with logo, theme and language controls, user menu, badges, and settings.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with header, tab navigation, admin-aware manager tab, and footer.",
  "frontend/src/components/layout/LanguageSelector.tsx": "Dropdown for selecting the app's language from predefined options.",
  "frontend/src/components/layout/ThemeToggle.tsx": "Button that toggles between light and dark themes using next-themes.",
  "frontend/src/components/manager/TaskAuditLog.tsx": "Displays a table of completed tasks with user info, comments, and before/after photo indicators.",
  "frontend/src/components/manager/TaskCompletionChart.tsx": "Generates a bar chart showing completed task counts per user.",
  "frontend/src/components/manager/UserPicker.tsx": "Provides a select dropdown for choosing a user, showing avatars and usernames.",
  "frontend/src/components/navigation/TabNav.tsx": "Renders a horizontal tab navigation bar with active-state styling.",
  "frontend/src/components/overtime/OvertimeDatePickerField.tsx": "A composite date input with synced native date picker restricted to the last two months.",
  "frontend/src/components/overtime/OvertimeForm.tsx": "Form for creating overtime entries with validation, date selection, and submission handling.",
  "frontend/src/components/overtime/OvertimeHistory.tsx": "Lists past overtime entries sorted by date, showing minutes added or deducted with icons.",
  "frontend/src/components/overtime/OvertimeTotals.tsx": "Calculates and displays total overtime minutes and formatted composite time.",
  "frontend/src/components/profile/PrivacyPanel.tsx": "Panel for exporting local data and clearing user data, including logout and confirmation dialog.",
  "frontend/src/components/profile/ProfileOnboardingModal.tsx": "Modal for initial user profile setup, letting users enter username/initials and pick dental, generated, or photo avatars with optional photo upload. Handles validation, upload progress, and saving the completed profile.",
  "frontend/src/components/profile/ProfilePhotoField.tsx": "Photo upload field with validation, preview, removal, and upload progress display. Provides UI controls for selecting or changing a profile image.",
  "frontend/src/components/profile/ProfileSettingsPanel.tsx": "Settings panel for editing an existing user profile, including username, initials, avatar selection, and photo upload or removal. Supports privacy settings navigation and saving profile changes.",
  "frontend/src/components/tasks/CompleteTaskDialog.tsx": "Dialog for marking a task complete with an optional comment and before/after photos. Converts uploaded images to blobs and submits completion data.",
  "frontend/src/components/tasks/CreateTaskDialog.tsx": "Dialog for creating a new task with title, description, and type selection. Validates required fields and submits the new task.",
  "frontend/src/components/tasks/EditTaskDialog.tsx": "Dialog for editing an existing task’s title, description, and type. Pre-fills fields from the task and saves updates on submission.",
  "frontend/src/components/tasks/TaskCard.tsx": "Displays a task card with styling, completion/edit actions, and reset logic using dialogs and hooks.",
  "frontend/src/components/tasks/TaskList.tsx": "Sorts tasks by completion and priority, then renders a list of TaskCard components or an empty-state message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAuthz.ts": "Fetches the caller's user role and admin status using the actor instance.",
  "frontend/src/hooks/useBadges.ts": "Computes earned badges based on overtime entries and completed tasks.",
  "frontend/src/hooks/useDentalAvatars.ts": "Fetches dental avatars from the backend and provides lookup by ID.",
  "frontend/src/hooks/useI18n.ts": "Returns the i18n context and ensures it's used within the provider.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity login, identity persistence, and context management for authentication.",
  "frontend/src/hooks/useManagerOvertime.ts": "Fetches overtime entries for a specific user and prepares export-friendly overtime data.",
  "frontend/src/hooks/useManagerTasks.ts": "Provides a query to export all task data from the backend.",
  "frontend/src/hooks/useNotify.ts": "Wraps toast notifications and normalizes error messages for display.",
  "frontend/src/hooks/useOvertime.ts": "Retrieves caller overtime entries and provides mutation to create new entries.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that feature-specific hooks reside elsewhere.",
  "frontend/src/hooks/useRoleSelection.ts": "Mutations to select assistant or manager roles and refresh related authorization queries.",
  "frontend/src/hooks/useTasks.ts": "Provides React Query hooks for fetching, creating, editing, completing, and resetting tasks with optimistic updates and error handling.",
  "frontend/src/hooks/useUserProfile.ts": "Defines hooks to fetch, update, and manage user profiles and photos through React Query and the backend actor.",
  "frontend/src/i18n/I18nProvider.tsx": "Sets up an i18n context with language persistence and translation lookup.",
  "frontend/src/i18n/translations.ts": "Exports supported languages and a large nested translation object for UI strings.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for themes, plus utility animations.",
  "frontend/src/main.tsx": "Initializes React app with Internet Identity and React Query providers.",
  "frontend/src/pages/manager/ManagerDashboard.tsx": "Manager dashboard with tabbed navigation for overtime management and statistics.",
  "frontend/src/pages/manager/ManagerOvertimePage.tsx": "Allows managers to view users' overtime entries, totals, and export them to CSV.",
  "frontend/src/pages/manager/ManagerStatsPage.tsx": "Manager stats page that loads tasks and profiles, renders charts/logs, and allows exporting task data to CSV via the actor canister.",
  "frontend/src/pages/OvertimePage.tsx": "Displays overtime form, totals, and history using localization and overtime hooks.",
  "frontend/src/pages/TasksPage.tsx": "Shows task list and creation UI and auto-checks for recurring task resets.",
  "frontend/src/utils/csv.ts": "Utility that converts an array of objects to CSV, escapes values, and triggers a browser download.",
  "frontend/src/utils/overtimeTime.ts": "Overtime utilities defining a 450‑minute workday and formatting minutes into days, hours, and minutes.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and handling hash‑based parameter extraction.",
  "frontend/tailwind.config.js": "Tailwind configuration with extended color tokens, container settings, animations, and layout plugins.",
  "project_state.json": "Project metadata capturing current state, architecture notes, known issues, and feature definitions for the FitGebit Team Tracker app."
}