{
  "backend/main.mo": "Defines data types for profiles, tasks, decisions, and overtime plus in-memory maps/lists and default dental avatar data.",
  "feature_evidence.json": "Lists feature evidence with affected files, components, test IDs, and confidence levels for overtime‑related updates.",
  "frontend-file-summaries.txt": "Aggregated summaries describing the purpose of multiple frontend components, hooks, and pages.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme tokens and dark mode variables for the app.",
  "frontend/index.html": "HTML entry point mounting the React app with root div and main script import.",
  "frontend/src/App.tsx": "App root handling Internet Identity auth flow and rendering login or authenticated content within theme and i18n providers.",
  "frontend/src/components/auth/AuthenticatedAppFlow.tsx": "Controls post-login role selection, profile onboarding, and main app shell with error and loading handling.",
  "frontend/src/components/auth/FirstManagerConfirmDialog.tsx": "Empty placeholder file for a manager confirmation dialog component.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen letting users pick assistant or manager role, optionally enter manager token, and trigger Internet Identity login.",
  "frontend/src/components/auth/RoleChoiceScreen.tsx": "UI for selecting assistant or manager role, handling token input and restoring pending choices from sessionStorage before submitting via role-selection hooks.",
  "frontend/src/components/avatars/avatarManifest.ts": "Empty module placeholder for avatar manifest data.",
  "frontend/src/components/avatars/AvatarPicker.tsx": "Fetches available dental avatars and displays a selectable grid with loading, error, and empty states.",
  "frontend/src/components/avatars/DentalAvatarImage.tsx": "Renders an SVG dental avatar by ID with validation and fallback logic for missing or invalid SVGs.",
  "frontend/src/components/avatars/GeneratedDentalAvatar.tsx": "Generates a pastel-colored circular SVG avatar displaying user initials.",
  "frontend/src/components/avatars/ProfileAvatar.tsx": "Chooses between uploaded photo, dental avatar, or generated initials avatar based on provided props.",
  "frontend/src/components/badges/badges.ts": "Defines static badge metadata including IDs, translation keys, and icons.",
  "frontend/src/components/badges/BadgeShelf.tsx": "Slide-out shelf showing all badges with earned status styling and translations.",
  "frontend/src/components/common/QueryErrorFallback.tsx": "Full-screen fallback component displaying error details and a retry button for failed queries.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with logo, theme and language controls, profile menu, settings and badge access, and logout handling.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with header, tab navigation, admin-only manager tab, routed page content, and footer.",
  "frontend/src/components/layout/LanguageSelector.tsx": "Dropdown for switching app language among predefined options.",
  "frontend/src/components/layout/ThemeToggle.tsx": "Button that toggles between light and dark themes using next-themes.",
  "frontend/src/components/manager/TaskAuditLog.tsx": "Displays a table of completed tasks with user info, comments, and before/after photos. Filters completed tasks and maps profiles for display.",
  "frontend/src/components/manager/TaskCompletionChart.tsx": "Builds a bar chart of task completions per user using Recharts. Aggregates completion counts from tasks and matches them with user profiles.",
  "frontend/src/components/manager/UserPicker.tsx": "Renders a dropdown to select a user, showing avatars and usernames. Emits the selected Principal to the parent component.",
  "frontend/src/components/navigation/TabNav.tsx": "Provides a horizontal tab navigation bar. Highlights the active tab and triggers tab change callbacks.",
  "frontend/src/components/overtime/OvertimeDatePickerField.tsx": "Offers a custom date input with synced native date picker, restricting selection to the past two months. Updates day, month, and year fields from user input or picker.",
  "frontend/src/components/overtime/OvertimeForm.tsx": "Form for creating overtime entries with validation, date limits, and add/deduct behavior. Submits minutes and date to backend and resets after success.",
  "frontend/src/components/overtime/OvertimeHistory.tsx": "Shows a chronological list of overtime entries with color‑coded add/deduct indicators. Formats timestamps into human‑readable dates.",
  "frontend/src/components/overtime/OvertimeTotals.tsx": "Computes and displays total signed overtime minutes and a formatted composite time. Uses memoization to derive totals from entries.",
  "frontend/src/components/profile/PrivacyPanel.tsx": "Panel for exporting cached user data and clearing local profile data. Supports logout-style deletion and includes confirmation dialogs.",
  "frontend/src/components/profile/ProfileOnboardingModal.tsx": "Modal for first‑time profile setup allowing username, initials, avatar selection, and optional photo upload with progress, then saving via API.",
  "frontend/src/components/profile/ProfilePhotoField.tsx": "Reusable photo upload field with validation, preview, delete option, and upload progress display.",
  "frontend/src/components/profile/ProfileSettingsPanel.tsx": "Profile editing panel enabling updates to username, initials, avatar or photo, with upload, removal, and save logic tied to user profile APIs.",
  "frontend/src/components/tasks/CompleteTaskDialog.tsx": "Dialog for completing a task with comment input and optional before/after photo attachments uploaded as blobs.",
  "frontend/src/components/tasks/CreateTaskDialog.tsx": "Dialog for creating a new task with title, description, and type selection, submitting to the task creation API.",
  "frontend/src/components/tasks/TaskCard.tsx": "Card displaying task details, type badges, completion state, and actions to complete or reset the task with optional modal.",
  "frontend/src/components/tasks/TaskList.tsx": "Renders a sorted list of tasks, placing completed tasks last and ordering by type priority before mapping them into TaskCard components.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides queries to fetch the caller's user role and admin status using the backend actor.",
  "frontend/src/hooks/useBadges.ts": "Computes earned badges from overtime and task data and returns them alongside all available badges.",
  "frontend/src/hooks/useDentalAvatars.ts": "Fetches and caches dental avatars from the backend and provides a lookup helper by avatar ID.",
  "frontend/src/hooks/useI18n.ts": "Returns the i18n context, ensuring it is used within an I18nProvider.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, providing identity state, login/logout functions, and status flags.",
  "frontend/src/hooks/useManagerOvertime.ts": "Fetches overtime entries for a specific user and provides a helper to format entries for export.",
  "frontend/src/hooks/useManagerTasks.ts": "Defines a disabled-by-default query to export all task data from the backend.",
  "frontend/src/hooks/useNotify.ts": "Wraps toast notifications and normalizes common backend error messages into user-friendly alerts.",
  "frontend/src/hooks/useOvertime.ts": "Provides hooks to fetch caller overtime entries and create new entries with automatic cache updates.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that feature-specific hooks are implemented elsewhere.",
  "frontend/src/hooks/useRoleSelection.ts": "Provides mutations for selecting assistant or manager roles and invalidates related role queries on success.",
  "frontend/src/hooks/useTasks.ts": "Includes hooks to fetch, create, complete, and reset tasks with optimistic updates and error recovery for weekly resets.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch, save, upload photos for, and list user profiles with corresponding cache invalidation.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides i18n context with language state, persistence, and translation lookup.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and translation dictionaries for the app.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables, dark mode palette, and animations.",
  "frontend/src/main.tsx": "Initializes React app with React Query, Internet Identity, and global CSS.",
  "frontend/src/pages/manager/ManagerDashboard.tsx": "Manager dashboard with tabs for overtime management and task statistics.",
  "frontend/src/pages/manager/ManagerOvertimePage.tsx": "Manager view to inspect users' overtime, select users, and export overtime CSV.",
  "frontend/src/pages/manager/ManagerStatsPage.tsx": "Manager page showing task charts, audit logs, and task data CSV export.",
  "frontend/src/pages/OvertimePage.tsx": "Displays overtime form, totals, and history after loading user overtime entries.",
  "frontend/src/pages/TasksPage.tsx": "Shows task list, create dialog, and handles recurring task reset logic.",
  "frontend/src/utils/csv.ts": "Utility to convert data arrays to CSV and trigger client‑side download.",
  "frontend/src/utils/overtimeTime.ts": "Provides overtime time constants and function to format minutes into days, hours, minutes.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radii, shadows, animations, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Stores the project’s current ICP app state, including requirements, architecture notes, and known issues for the FitGebit Team Tracker."
}