{
  "backend/main.mo": "Defines the main canister actor with user profiles, dental avatars, tasks, task completion, access control, and mixins for storage and authorization.",
  "backend/migration.mo": "Migration module converting old user profiles to the new format by adding initials and profilePhoto fields while preserving other actor state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of summarized descriptions for key frontend components and hooks used across the app.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and global styles.",
  "frontend/index.html": "HTML entry point setting up the root element and loading the main React script.",
  "frontend/src/App.tsx": "Root component handling Internet Identity auth and routing to either login or the authenticated app flow.",
  "frontend/src/components/auth/AuthenticatedAppFlow.tsx": "Determines whether to show role choice, profile onboarding, fallback error UI, or the main app based on role and profile queries.",
  "frontend/src/components/auth/FirstManagerConfirmDialog.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/auth/LoginScreen.tsx": "Provides a login UI where users select assistant or manager role, optionally enter a manager token, and triggers Internet Identity login with stored pending role data.",
  "frontend/src/components/auth/RoleChoiceScreen.tsx": "Allows users to confirm their stored or selected role choice and submit it to the backend, including optional manager token handling.",
  "frontend/src/components/avatars/avatarManifest.ts": "Empty file placeholder for avatar-related manifest data.",
  "frontend/src/components/avatars/AvatarPicker.tsx": "Fetches, initializes, and displays selectable dental avatars with loading and error states.",
  "frontend/src/components/avatars/DentalAvatarImage.tsx": "Renders an SVG dental avatar by ID or a placeholder if unavailable, encoding the SVG safely for display.",
  "frontend/src/components/avatars/GeneratedDentalAvatar.tsx": "Generates a pastel-colored avatar SVG containing tooth art and user initials.",
  "frontend/src/components/avatars/ProfileAvatar.tsx": "Displays a user's avatar by prioritizing photo, dental avatar, or generated initials-based avatar.",
  "frontend/src/components/badges/badges.ts": "Defines static badge metadata including IDs, translation keys, and icons.",
  "frontend/src/components/badges/BadgeShelf.tsx": "Displays all badges in a slide-out shelf, highlighting earned ones and showing details.",
  "frontend/src/components/common/QueryErrorFallback.tsx": "Provides a full-page error display with retry support and translated messaging.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the main app header with logo, theme and language controls, user menu, badges, and settings.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main layout with header, tabs, and routing between tasks, overtime, and manager pages based on admin status.",
  "frontend/src/components/layout/LanguageSelector.tsx": "Dropdown button allowing users to switch between supported languages using i18n state.",
  "frontend/src/components/layout/ThemeToggle.tsx": "Button that toggles between light and dark themes via next-themes.",
  "frontend/src/components/manager/TaskAuditLog.tsx": "Displays a table of completed tasks with user info, comments, and photo indicators.",
  "frontend/src/components/manager/TaskCompletionChart.tsx": "Builds a bar chart summarizing how many tasks each user has completed.",
  "frontend/src/components/manager/UserPicker.tsx": "Select dropdown for choosing a user, showing avatars and usernames.",
  "frontend/src/components/navigation/TabNav.tsx": "Renders a tab bar allowing switching between sections based on activeTab state.",
  "frontend/src/components/overtime/OvertimeForm.tsx": "Form for adding or subtracting overtime entries with validation and disabled backend action.",
  "frontend/src/components/overtime/OvertimeHistory.tsx": "Lists overtime entries sorted by timestamp with visual indicators for additions and deductions.",
  "frontend/src/components/overtime/OvertimeTotals.tsx": "Calculates and displays total overtime minutes and equivalent workdays.",
  "frontend/src/components/profile/PrivacyPanel.tsx": "Privacy settings panel enabling data export, local data clearing, and logout actions.",
  "frontend/src/components/profile/ProfileOnboardingModal.tsx": "Modal for initial profile setup allowing username, initials, avatar selection, and optional photo upload with progress tracking and save handling.",
  "frontend/src/components/profile/ProfilePhotoField.tsx": "File input component for selecting, previewing, validating, and removing profile photos with optional upload progress display.",
  "frontend/src/components/profile/ProfileSettingsPanel.tsx": "Settings panel for editing an existing user profile, managing avatars and photos, and updating or removing profile data.",
  "frontend/src/components/tasks/CompleteTaskDialog.tsx": "Dialog for completing a task with optional comment and before/after photo uploads, submitting data to the backend.",
  "frontend/src/components/tasks/CreateTaskDialog.tsx": "Dialog for creating a new task with title and type selection, handling validation and submission.",
  "frontend/src/components/tasks/TaskCard.tsx": "Card showing task details, completion status, related metadata, and a button to mark tasks as done.",
  "frontend/src/components/tasks/TaskList.tsx": "Lists tasks sorted by completion status and priority, rendering them as TaskCards or showing an empty-state message.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the Internet Identity, reinitializing and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides queries to fetch the caller’s role and admin status from the backend actor.",
  "frontend/src/hooks/useBadges.ts": "Computes earned badges from overtime entries and task completions.",
  "frontend/src/hooks/useDentalAvatars.ts": "Fetches dental avatars, initializes them if needed, and provides lookup by ID.",
  "frontend/src/hooks/useI18n.ts": "Returns i18n context, ensuring it is used within the provider.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login, state, and auth client creation with context.",
  "frontend/src/hooks/useManagerOvertime.ts": "Empty placeholder for manager overtime hooks.",
  "frontend/src/hooks/useManagerTasks.ts": "Provides a disabled query for exporting task data through the backend actor.",
  "frontend/src/hooks/useNotify.ts": "Simple notification wrapper with i18n‑aware error handling.",
  "frontend/src/hooks/useOvertime.ts": "Provides no‑op overtime hooks returning empty data for deprecated functionality.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file referencing where feature‑specific hooks live.",
  "frontend/src/hooks/useRoleSelection.ts": "Mutations to select assistant or manager roles, refreshing related authz queries.",
  "frontend/src/hooks/useTasks.ts": "CRUD hooks for tasks, including creating, completing, and resetting tasks.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching, saving, and modifying user profiles and photos.",
  "frontend/src/i18n/I18nProvider.tsx": "I18n provider storing language in localStorage and exposing translation lookup.",
  "frontend/src/i18n/translations.ts": "Defines language types and translation strings for English, Dutch, and French covering UI labels, tasks, overtime, manager sections, badges, and errors.",
  "frontend/src/index.css": "Configures Tailwind layers, CSS variables for themes, global styles, and adds float animation.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/manager/ManagerDashboard.tsx": "Manager dashboard with tabs for overtime management and task statistics.",
  "frontend/src/pages/manager/ManagerOvertimePage.tsx": "Manager view for selecting a user and viewing nonexistent overtime data with disabled CSV export.",
  "frontend/src/pages/manager/ManagerStatsPage.tsx": "Manager statistics page showing task charts and audit logs with CSV export capability.",
  "frontend/src/pages/OvertimePage.tsx": "Displays overtime form, totals, and history, showing a loading state while fetching entries.",
  "frontend/src/pages/TasksPage.tsx": "Fetches tasks, resets recurring tasks on mount, and shows the task list with a dialog for creating new tasks.",
  "frontend/src/utils/csv.ts": "Utility to convert data arrays to CSV and trigger file download in the browser.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, animations, plugins, and extended utilities.",
  "project_state.json": "Holds the app’s current project state, including functional requirements, architectural notes, known issues, and feature definitions for the FitGebit Team Tracker. Used as a master specification for authentication, roles, profiles, avatars, tasks, and exports."
}