{
  "kind": "build_request",
  "title": "Fix avatar rendering, add task descriptions, and display overtime totals as days/hours/minutes",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-54",
      "text": "Fix dental avatar rendering so avatars reliably display across the app (avatar picker, profile onboarding/settings, header/user menu, and manager user picker) instead of appearing missing/not showing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "The avatars are currently not showing"
        ]
      },
      "acceptanceCriteria": [
        "All 16 dental SVG avatars render as visible images (not blank cells and not broken/missing image links) in AvatarPicker.",
        "Profile avatar rendering works for users who have selected a dental SVG avatar (including in header/user menu and manager user picker).",
        "If an avatar SVG is invalid/missing, the UI shows a deterministic fallback (no empty/blank area).",
        "No console errors are produced during normal avatar rendering (excluding intentional warning logs for unexpected avatar counts)."
      ]
    },
    {
      "id": "REQ-55",
      "text": "Add a multi-line task description field that appears directly under the task title when creating a task, allowing users to describe the task in detail; persist this description in the backend task model and display it under the task title on task cards.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Place a comment/description box directly under each task title",
          "This allows users to explain the task in detail",
          "Should support multi-line text input"
        ]
      },
      "acceptanceCriteria": [
        "Create Task dialog includes a multi-line text input placed directly under the title input.",
        "Submitting a new task stores the description and it is returned by the backend in `getTasks()`.",
        "Task cards render the description directly under the task title (when a description is present).",
        "Existing tasks created before this change continue to load without errors (description treated as empty/missing).",
        "All new user-facing text added for this feature uses i18n keys with English strings present."
      ]
    },
    {
      "id": "REQ-56",
      "text": "Update overtime totals display to convert total minutes into a composite format using 60 minutes = 1 hour and 8 hours = 1 day, and show totals in the format \"X day(s), Y hour(s), Z minute(s)\" (e.g., 550 minutes displays as \"1 day, 1 hour, 10 minutes\").",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "60 minutes = 1 hour (when minutes ≥ 60, subtract 60 from minutes and add 1 to hours)",
          "8 hours = 1 day (when hours ≥ 8, subtract 8 from hours and add 1 to days)",
          "Example: 550 minutes should display as \"1 day, 1 hour, 10 minutes\""
        ]
      },
      "acceptanceCriteria": [
        "OvertimeTotals converts summed signed minutes into (days, hours, minutes) using 8 hours/day and 60 minutes/hour.",
        "Example validation: total of 550 minutes displays as \"1 day, 1 hour, 10 minutes\".",
        "The composite display works for totals >= 0 and totals < 0 (negative totals retain a leading minus sign and use absolute values for components).",
        "Manager overtime page (which reuses OvertimeTotals) reflects the same composite display for the selected user."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Apply the user’s UI instructions only to the UI element corresponding to XPath /html[1]/body[1]/div[3]/div[2]/div[4] (identify the owning React component and confine layout changes accordingly).",
    "Use English for any new/changed user-facing text introduced by these changes (via i18n keys)."
  ],
  "nonGoals": [
    "Do not add new authentication methods (Internet Identity remains the only auth mechanism).",
    "Do not add real-time features (WebSockets, push notifications, chat).",
    "Do not change overtime entry creation rules (date validation, add/deduct semantics) beyond updating totals display formatting.",
    "Do not redesign the overall navigation or add new app sections."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}