{
  "kind": "build_request",
  "title": "UI polish: opaque task dialogs, remove “optional” wording, show avatars, and simplify branding text",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Make the Task Create and Task Completion popup windows fully opaque (no see-through/transparency) in both light and dark mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The task UI is see through, can you make the background of the popup windows opaque.\n\n1. Task creatie on and task completion"
        ]
      },
      "acceptanceCriteria": [
        "When CreateTaskDialog is open, the dialog content background is fully opaque (no alpha/translucent background showing underlying page).",
        "When CompleteTaskDialog is open, the dialog content background is fully opaque (no alpha/translucent background showing underlying page).",
        "The change applies in both light and dark mode."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Remove the word “optional” everywhere it appears in Tasks and Overtime sections, including labels/placeholders and any supporting helper text, while keeping the underlying fields optional.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Remove the word optional and also remove the text next to the logo.",
          "2. Wherever it's written in the task or overtime section"
        ]
      },
      "acceptanceCriteria": [
        "Tasks UI no longer shows '(optional)' for the completion comment field.",
        "Tasks UI no longer shows '(optional)' for Before Photo and After Photo labels.",
        "Overtime UI no longer shows '(optional)' for the comment field.",
        "All updated user-facing strings remain routed through i18n (no new hard-coded English strings introduced for these labels)."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Update branding text so that the app displays only “FitGebit” next to/under the logo (remove extra text such as the subtitle) in the header and login screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "remove the text next to the logo. just FitGebit is fine"
        ]
      },
      "acceptanceCriteria": [
        "AppHeader shows only the single title text “FitGebit” and does not render any subtitle/secondary line.",
        "LoginScreen shows only the single title text “FitGebit” and does not render any subtitle/secondary line.",
        "The displayed title is driven from i18n (update the English translation for app.title to “FitGebit”)."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Fix the avatar picker so the existing 16 dental avatars reliably render and are visible in the avatar grid (no placeholders/blank cells) and remove any remaining hard-coded non-i18n empty-state text in the avatar picker.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can you create a few avatars to choose from",
          "No I just don't see them, 16 is fine if only I can see them"
        ]
      },
      "acceptanceCriteria": [
        "AvatarPicker renders an SVG image for each avatar returned by getAllDentalAvatars; grid items are not blank and do not show the '?' fallback when avatar data is present.",
        "If avatars cannot be loaded or the list is empty, the empty-state message is translated via i18n (no hard-coded 'No avatars available' text).",
        "No changes increase the avatar count beyond the existing 16."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui must not be edited directly; only compose/override via props/classes in feature components.",
    "Do not modify any immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration if strictly required (not expected for these UI-only changes).",
    "Use English for any new/changed user-facing text included in this build request."
  ],
  "nonGoals": [
    "Creating new avatars or increasing the avatar set beyond the existing 16.",
    "Changing task/overtime business logic or backend schemas.",
    "Implementing new authentication/role flows (not requested in this update)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}