{
  "kind": "build_request",
  "title": "Show task title in completion popup and add visible per-task reset button for assistants",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-63",
      "text": "Update the task completion dialog (mark-done popup) to display the current task’s title as a smaller subtitle-style line near the top of the dialog, so users can clearly confirm which task they are marking done.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When clicking 'mark done' I want the popup to also show the title of the task at hand, so no mistakes are made",
          "smaller subtitle-style placement"
        ]
      },
      "acceptanceCriteria": [
        "When the completion dialog is opened from any task card, the dialog shows the selected task’s title in the dialog content/header area as a smaller subtitle-style element (not as the main dialog title).",
        "The displayed title matches the task title shown on the task card (no truncation beyond existing UI constraints, no mismatched task).",
        "The completion dialog remains fully opaque in both light and dark mode (no see-through background regression)."
      ]
    },
    {
      "id": "REQ-64",
      "text": "Add a clearly visible per-task manual reset button that is accessible to Assistants in the task list UI. The button must be present (not missing) and must reset the task back to “not done” by calling the existing resetTask mutation so the task becomes incomplete again after the action completes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I don't see this button that's why I asked for it again",
          "it should be visible to all assistants",
          "Add a manual reset button for each task. This should allow me to manually reset any task back to \"not done\" status, regardless of whether it's a daily, weekly, monthly, or urgent task."
        ]
      },
      "acceptanceCriteria": [
        "For a completed task, Assistants can see a reset control on the task card without needing to open any other screen.",
        "Clicking the reset control triggers the existing frontend resetTask flow (via the current hooks) and, after success, the task displays as not completed in the list.",
        "The reset control is not hidden for Assistants (based on role) anywhere the task list is displayed.",
        "Any new user-facing label(s) introduced for this reset action use the i18n system and have English text present (e.g., a key like tasks.resetTask)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn components are read-only).",
    "Keep the existing React Query task caching behavior (placeholderData / invalidateQueries) intact except where required to surface the reset action reliably.",
    "Use English for any new/changed user-facing text introduced by this change (and route it through the existing i18n key system)."
  ],
  "nonGoals": [
    "Do not redesign the overall tasks page layout beyond adding the requested subtitle and reset control.",
    "Do not change backend task reset semantics or data model as part of this request.",
    "Do not add new task types or alter task sorting/reset boundary logic as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}