{
  "kind": "build_request",
  "title": "Ensure weekly/monthly task completion persists until scheduled or manual reset",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-57",
      "text": "Keep the current Tasks mode (task types: weekly/monthly/urgent only) and ensure completed weekly and monthly tasks remain completed across app refreshes until their next scheduled reset window or until the user manually reactivates/resets them.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Keep current mode, make sure the completed tasks stay completed untill the weekly or monthly or manual reset."
        ]
      },
      "acceptanceCriteria": [
        "After a user marks a weekly task complete, refreshing/reopening the app does not change it back to incomplete unless it is now past the next weekly reset boundary.",
        "After a user marks a monthly task complete, refreshing/reopening the app does not change it back to incomplete unless it is now past the next monthly reset boundary.",
        "Urgent tasks are never auto-reset by the recurring reset logic; they remain completed until manually reset.",
        "The backend remains the source of truth: `getTasks()` returns `isCompleted=true` for completed tasks until a legitimate reset occurs (scheduled reset boundary or manual reset)."
      ]
    },
    {
      "id": "REQ-58",
      "text": "Update the backend recurring reset logic (`resetRecurringTasksIfNeeded`) so it only resets tasks that are actually due for reset (weekly: Monday boundary; monthly: first Monday of the month boundary), and does not prematurely reset tasks simply because the app opened/refreshed.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "make sure the completed tasks stay completed untill the weekly or monthly or manual reset."
        ]
      },
      "acceptanceCriteria": [
        "Calling `resetRecurringTasksIfNeeded` multiple times within the same weekly/monthly period does not reset already-completed weekly/monthly tasks.",
        "At the first app open after the weekly reset boundary (Monday, using clinic local time as previously specified in this conversation), completed weekly tasks are reset to incomplete and `lastResetAt` is updated.",
        "At the first app open after the monthly reset boundary (first Monday of the month, using clinic local time as previously specified in this conversation), completed monthly tasks are reset to incomplete and `lastResetAt` is updated.",
        "The function does not reset urgent tasks.",
        "No new user-facing error messages are introduced by this change; any traps remain developer-focused and existing patterns are preserved."
      ]
    },
    {
      "id": "REQ-59",
      "text": "Update the frontend task reset trigger so that opening the Tasks page does not cause premature resets; the UI must reflect the backend’s persisted completion state and only change when the backend determines a reset is due or when a user manually resets/reactivates a task.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "when someone refreshes the app it should still be marked done till next day or week or month."
        ]
      },
      "acceptanceCriteria": [
        "On TasksPage mount, tasks that were completed in the current week/month remain shown as completed after the reset check runs.",
        "If the backend determines a reset is due, the UI updates accordingly after the reset mutation finishes and tasks refetch.",
        "If the reset mutation fails, the UI still shows the previously fetched task completion states (no forced local flip to incomplete)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any files under frontend/src/components/ui, or other paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Use English for any new/changed user-facing text introduced by this change (and follow the existing i18n pattern if UI text changes are required)."
  ],
  "nonGoals": [
    "Do not reintroduce daily tasks or daily reset behavior.",
    "Do not change the task domain model beyond what is needed to correctly persist and reset completion state for weekly/monthly tasks.",
    "Do not add new UI features like completion history/audit log, task reactivation buttons, or popup title changes unless explicitly requested again."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}