{
  "kind": "build_request",
  "title": "Add task editing (title, type, description) for Assistants and Managers while preserving completion history",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-71",
      "text": "Add a backend API to edit an existing task’s editable fields (title, description, taskType) by task ID, allowing any authenticated user (Assistant or Manager) to perform the edit.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-8"
        ],
        "quotes": [
          "a task should be able to be edited",
          "1 all of them\n2 yes"
        ]
      },
      "acceptanceCriteria": [
        "A new shared (update) method exists in backend/main.mo to update a task’s title, description, and taskType given a taskId.",
        "The method rejects unauthenticated/unauthorized callers using the same permission approach as createTask/completeTask/resetTask (i.e., users with #user permission).",
        "The method validates that title and description are non-empty (same rules as createTask).",
        "If the task ID does not exist, the method traps with a clear error (e.g., \"Task not found\")."
      ]
    },
    {
      "id": "REQ-72",
      "text": "Ensure task edits preserve existing completion state and completion history data: editing a task must not change isCompleted, currentCompletion, lastResetAt, or nextResetTimestamp.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "2 yes"
        ]
      },
      "acceptanceCriteria": [
        "When editing a completed task, it remains completed after the edit.",
        "When editing a completed task, its currentCompletion (completedBy/comment/photos/completedAt) remains unchanged after the edit.",
        "Editing does not trigger any reset logic or modify lastResetAt/nextResetTimestamp.",
        "Manager audit/stat/export endpoints that return tasks continue to include the updated task fields without losing completion info."
      ]
    },
    {
      "id": "REQ-73",
      "text": "Add a frontend task editing flow that is accessible to both Assistants and Managers: show an Edit action on each task, open an Edit Task dialog pre-filled with the task’s current title, description, and type, and save changes via a new React Query mutation calling the backend edit API.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-8"
        ],
        "quotes": [
          "a task should be able to be edited",
          "Both"
        ]
      },
      "acceptanceCriteria": [
        "Each TaskCard renders a clearly discoverable Edit button/action for both completed and incomplete tasks.",
        "Clicking Edit opens a dialog/sheet that allows editing all fields: title, description, and type, with inputs pre-populated from the selected task.",
        "Submitting the edit calls a new frontend mutation (in frontend/src/hooks/useTasks.ts or a new tasks hook file) that invokes the new backend edit API.",
        "On successful save, the tasks list updates to show the new values without requiring a manual page refresh (invalidate/refetch the ['tasks'] query).",
        "If the backend returns an error, it is surfaced using the existing notification/error handling pattern (useNotify.handleError).",
        "The completion UI (Completed badge, completion metadata, photos) still displays exactly as before after editing a completed task."
      ]
    },
    {
      "id": "REQ-74",
      "text": "Add/adjust i18n translation keys for any new user-facing text introduced by task editing (English/Dutch/French dictionaries), and ensure any new/changed user-facing validation/error text used by the editing UI is present in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-8"
        ]
      },
      "acceptanceCriteria": [
        "New i18n keys exist for task editing UI labels/buttons (e.g., \"Edit Task\", \"Save Changes\", and any field labels/placeholders if newly introduced).",
        "English translations are provided for all newly introduced keys.",
        "Dutch and French translations are provided for the same keys (matching the app’s existing i18n structure).",
        "No hard-coded non-i18n UI strings are introduced in the task editing UI."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any other paths listed in frontend.immutablePaths.",
    "Use English for any new/changed user-facing text introduced by this change (and add corresponding nl/fr translations as per the existing i18n structure)."
  ],
  "nonGoals": [
    "Do not add task deletion in this change.",
    "Do not change task completion/reset behavior beyond ensuring edits do not affect completion history/state.",
    "Do not add per-user task assignment or new task fields beyond editing the existing title/description/type."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}