{
  "kind": "build_request",
  "title": "Role-choice login with manager token, tooth logo, initials validation, and replace avatars with 16 canister-served SVGs",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Replace the current post-login role auto-assignment/first-manager confirmation flow with an explicit role-choice flow (Assistant or Manager) where Manager access requires entering the token \"ICPmaxi313\".",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "The UI should gice the choice if one wants to login as assistant or manager. The manager needs to input the token ICPmaxi313",
          "Login screen should be for assistant & Manager:(needs token ICPmaxi313)",
          "1. yes"
        ]
      },
      "acceptanceCriteria": [
        "After Internet Identity authentication, the user must be prompted to choose a role: Assistant or Manager.",
        "Selecting Manager requires entering the exact token \"ICPmaxi313\"; invalid token prevents proceeding as Manager and shows a user-facing error message.",
        "Selecting Assistant never requires a token.",
        "The previous 'first user becomes Manager' behavior and UI confirmation are no longer used anywhere in the app flow."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Update backend authorization so that the app can grant Manager/admin privileges only when the caller successfully completes the Manager token flow, and otherwise grants Assistant/user access.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "The manager needs to input the token ICPmaxi313",
          "Login screen should be for assistant & Manager:(needs token ICPmaxi313)",
          "1. yes"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a single, explicit method for role setup/upgrade that checks the manager token for Manager selection and assigns the appropriate authorization role for the caller.",
        "Callers without completing the Manager token flow do not receive admin privileges and cannot access manager-only endpoints (e.g., getAllUserProfiles, exportTaskData).",
        "Role selection persists across sessions for that principal (i.e., after re-login the user keeps their assigned role).",
        "Any legacy behavior that implicitly grants admin privileges to the first caller/user is removed or disabled."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Revise the login screen UI to include role selection (Assistant/Manager) and, when Manager is selected, a token input field; keep Internet Identity as the authentication mechanism.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-6"
        ],
        "quotes": [
          "The UI should gice the choice if one wants to login as assistant or manager.",
          "Login screen should be for assistant & Manager:(needs token ICPmaxi313)"
        ]
      },
      "acceptanceCriteria": [
        "Login screen presents Assistant and Manager options clearly.",
        "When Manager is selected, a token input field is displayed and required to proceed as Manager.",
        "The screen still uses Internet Identity for authentication; no third-party auth is added.",
        "All new/updated user-facing strings are integrated via the existing i18n system."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Remove the FirstManagerConfirmDialog flow from the authenticated app startup and replace it with the new role-choice/token flow so that App.tsx never triggers the old manager confirmation dialog.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "1. yes"
        ]
      },
      "acceptanceCriteria": [
        "The app no longer displays the existing first-manager confirmation dialog at any time.",
        "Authenticated users who have not yet selected a role are routed to the new role-choice step instead.",
        "After successful role choice, the app proceeds to profile onboarding (if needed) and then the main app shell."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Update profile onboarding to require a username and initials of length 2–3 characters on first login, and prevent saving if initials are not 2 or 3 characters.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-12"
        ],
        "quotes": [
          "Users: Set username and 2-3 initials on first login.",
          "Users: Set username and 2-3 initials on first login."
        ]
      },
      "acceptanceCriteria": [
        "The profile onboarding form rejects initials with length < 2 or > 3.",
        "Initials continue to be stored uppercase.",
        "Validation errors are shown to the user and block the Save action until the form is valid."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Replace the existing 48-avatar static manifest and paginated avatar picker with exactly 16 simple cute dental SVG avatars, served from the canister as SVG strings (or via canister URLs) and displayed in a single grid with no pagination.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "Avatars: Fix loading – provide 16 simple cute SVG dental icons (e.g., tooth smile, toothbrush, floss; store as strings in canister, return list/URLs, show all in a single grid).",
          "2. Replace the 48 with 16"
        ]
      },
      "acceptanceCriteria": [
        "The avatar set is exactly 16 items; the previous 48-avatar set is removed from the UI selection flow.",
        "Avatars are stored in the backend canister as SVG strings (not only as frontend static files).",
        "Frontend fetches the avatar list from the backend and renders all 16 in a single grid (no pagination controls).",
        "Avatar images reliably render (fix the current issue where SVG avatars are not showing/loading).",
        "User profiles continue to store an avatar identifier, and existing UI that displays a user’s avatar uses the canister-served avatar data."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Add/adjust i18n translation keys for any new or changed user-facing text introduced by the role-choice login/token flow and the updated onboarding validations (English, Dutch, French remain supported).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-6"
        ],
        "quotes": [
          "The UI should gice the choice if one wants to login as assistant or manager.",
          "Users: Set username and 2-3 initials on first login."
        ]
      },
      "acceptanceCriteria": [
        "All new strings introduced by the updated login/role flow and onboarding validation are translated in en/nl/fr dictionaries.",
        "No UI shows missing translation placeholders for the updated screens."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Replace the app’s logo/branding mark with a cute tooth icon with no text, and use it on the login screen in place of the current Sparkles icon.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-12"
        ],
        "quotes": [
          "Logo: Cute tooth icon (no text).",
          "Logo: Cute tooth icon (no text)."
        ]
      },
      "acceptanceCriteria": [
        "Login screen displays the provided tooth icon logo (no text) instead of the Sparkles icon.",
        "The logo is included as a static asset in the frontend and loads in both light and dark modes."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo (no additional backend services).",
    "Do not edit files in frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Manager token must be exactly \"ICPmaxi313\" (case-sensitive).",
    "Avatar set must be replaced (not extended): exactly 16 avatars total."
  ],
  "nonGoals": [
    "Do not add any third-party authentication methods beyond Internet Identity.",
    "Do not implement new overtime functionality beyond what already exists in the project.",
    "Do not redesign the Tasks domain beyond the existing weekly/monthly/urgent model already implemented."
  ],
  "imageRequirements": {
    "required": [
      "Cute tooth icon logo, no text (app-logo-tooth.dim_256x256.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}