{
  "kind": "build_request",
  "title": "Change overtime workday conversion to 7h30 (450 minutes) everywhere",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-69",
      "text": "Update all overtime total/conversion displays so that 1 full workday equals 7 hours 30 minutes (450 minutes) instead of 8 hours (480 minutes), including the composite total format (\"X day(s), Y hour(s), Z minute(s)\") and any other UI that derives days from minutes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-10"
        ],
        "quotes": [
          "Change A full workday to 7 hours and 30 minutes instead of 8 hours.",
          "1. Yes\n2. Yes"
        ]
      },
      "acceptanceCriteria": [
        "In the overtime totals UI, composite formatting uses 450 minutes per day (not 480).",
        "Any UI that converts minutes to days/workdays reflects 7h30 per day consistently for both Assistants and Managers (including Manager overtime views).",
        "Composite formatting continues to use 60 minutes = 1 hour and displays negative totals with a leading '-' when applicable."
      ]
    },
    {
      "id": "REQ-70",
      "text": "Ensure that changing the workday conversion rule immediately affects historical (already-recorded) overtime totals shown throughout the app, without requiring users to re-enter overtime entries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-10"
        ],
        "quotes": [
          "2. Yes"
        ]
      },
      "acceptanceCriteria": [
        "After the change, the same existing overtime entries produce updated day-based/composite totals everywhere they are displayed.",
        "No data-reset or manual user action is required to see updated totals for existing entries (refreshing the page is sufficient)."
      ]
    }
  ],
  "constraints": [
    "Respect the existing single-actor Motoko backend architecture; do not introduce additional backend services.",
    "Do not edit files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text introduced or changed by this work."
  ],
  "nonGoals": [
    "Do not change how overtime entries are stored (minutes and dates) beyond what is required for display conversion.",
    "Do not change overtime add/deduct color semantics or the overtime entry workflow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}