{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Persist task completion state by deferring recurring reset triggers to backend-due windows",
  "requirements": [
    {
      "id": "REQ-57",
      "summary": "Ensure weekly/monthly task completion status shown in the UI stays consistent across refreshes by relying on backend-provided persisted state and avoiding any frontend-driven premature resets.",
      "acceptanceCriteria": [
        "After a user marks a weekly task complete, refreshing/reopening the app does not change it back to incomplete unless it is now past the next weekly reset boundary.",
        "After a user marks a monthly task complete, refreshing/reopening the app does not change it back to incomplete unless it is now past the next monthly reset boundary.",
        "Urgent tasks are never auto-reset by the recurring reset logic; they remain completed until manually reset.",
        "The backend remains the source of truth: `getTasks()` returns `isCompleted=true` for completed tasks until a legitimate reset occurs (scheduled reset boundary or manual reset)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Adjust Tasks page behavior so it displays the initially fetched `getTasks()` results as the source of truth and triggers the recurring reset check in a way that does not cause UI to locally flip completion state on refresh (e.g., run the reset check only after tasks have been fetched at least once, and do not block rendering on the reset check)."
        },
        {
          "path": "frontend/src/hooks/useTasks.ts",
          "operation": "modify",
          "description": "Refine the recurring reset mutation and related cache behavior to ensure task completion state remains derived from the latest successful `getTasks()` fetch and is not overridden by any local assumptions; keep urgent tasks unaffected by any frontend sorting/logic (no frontend auto-reset)."
        }
      ]
    },
    {
      "id": "REQ-59",
      "summary": "Update the frontend recurring reset trigger so opening Tasks does not cause premature resets and the UI only changes when backend state changes or when the user manually resets/reactivates a task.",
      "acceptanceCriteria": [
        "On TasksPage mount, tasks that were completed in the current week/month remain shown as completed after the reset check runs.",
        "If the backend determines a reset is due, the UI updates accordingly after the reset mutation finishes and tasks refetch.",
        "If the reset mutation fails, the UI still shows the previously fetched task completion states (no forced local flip to incomplete)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Change the mount-time reset behavior to avoid any perceived \"reset on open\" effect: trigger the reset check only once per page visit after the initial tasks query has settled, and ensure errors are handled without altering already-rendered task completion state."
        },
        {
          "path": "frontend/src/hooks/useTasks.ts",
          "operation": "modify",
          "description": "Ensure `useResetRecurringTasks` does not perform any optimistic updates to tasks; on success it should refetch tasks to reflect backend decisions, and on failure it should leave the existing tasks cache untouched so the UI continues to show the last fetched completion state."
        }
      ]
    }
  ]
}