{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update overtime workday conversion to 7h30 (450 minutes) across frontend",
  "requirements": [
    {
      "id": "REQ-69",
      "summary": "Change all overtime minutes→workdays/composite displays to use 450 minutes per day (7h30) instead of 480, including negative totals formatting.",
      "acceptanceCriteria": [
        "In the overtime totals UI, composite formatting uses 450 minutes per day (not 480).",
        "Any UI that converts minutes to days/workdays reflects 7h30 per day consistently for both Assistants and Managers (including Manager overtime views).",
        "Composite formatting continues to use 60 minutes = 1 hour and displays negative totals with a leading '-' when applicable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/overtimeTime.ts",
          "operation": "create",
          "description": "Create a shared overtime time conversion utility that defines the workday size as 450 minutes and provides composite formatting (days/hours/minutes) with correct negative-sign handling and 60 minutes per hour."
        },
        {
          "path": "frontend/src/components/overtime/OvertimeTotals.tsx",
          "operation": "modify",
          "description": "Refactor overtime composite total formatting to use the shared utility (450 minutes per workday) rather than the current hardcoded 480-minute day, ensuring the output remains \"X day(s), Y hour(s), Z minute(s)\" and preserves leading '-' for negative totals."
        }
      ]
    },
    {
      "id": "REQ-70",
      "summary": "Ensure the updated workday conversion rule is applied purely at display-time so historical overtime totals update immediately everywhere they are shown.",
      "acceptanceCriteria": [
        "After the change, the same existing overtime entries produce updated day-based/composite totals everywhere they are displayed.",
        "No data-reset or manual user action is required to see updated totals for existing entries (refreshing the page is sufficient)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/overtimeTime.ts",
          "operation": "modify",
          "description": "Ensure the conversion rule is a frontend constant used only for derived display calculations (not persisted), so any existing stored overtime minutes automatically render using the updated 450-min/day rule after refresh."
        },
        {
          "path": "frontend/src/pages/manager/ManagerOvertimePage.tsx",
          "operation": "modify",
          "description": "Verify manager overtime totals/historical views continue to use the shared OvertimeTotals component (and thus the updated 450-min/day rule) for all selected users, ensuring historical entries display updated totals after refresh."
        }
      ]
    }
  ]
}