{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "UI polish: opaque dialogs, remove “optional” wording, avatar visibility, and simplified branding",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Make Task Create and Task Completion dialogs fully opaque in light/dark mode (no translucent dialog surface).",
      "acceptanceCriteria": [
        "When CreateTaskDialog is open, the dialog content background is fully opaque (no alpha/translucent background showing underlying page).",
        "When CompleteTaskDialog is open, the dialog content background is fully opaque (no alpha/translucent background showing underlying page).",
        "The change applies in both light and dark mode."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/tasks/CreateTaskDialog.tsx",
          "operation": "modify",
          "description": "Pass an explicit, fully-opaque surface background to the shadcn DialogContent (e.g., non-alpha background classes for light and dark) so the create-task popup is not see-through. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/tasks/CompleteTaskDialog.tsx",
          "operation": "modify",
          "description": "Pass an explicit, fully-opaque surface background to the shadcn DialogContent (e.g., non-alpha background classes for light and dark) so the complete-task popup is not see-through. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Remove the word “optional” from Tasks and Overtime UI labels/placeholders while keeping fields optional and strings i18n-driven.",
      "acceptanceCriteria": [
        "Tasks UI no longer shows '(optional)' for the completion comment field.",
        "Tasks UI no longer shows '(optional)' for Before Photo and After Photo labels.",
        "Overtime UI no longer shows '(optional)' for the comment field.",
        "All updated user-facing strings remain routed through i18n (no new hard-coded English strings introduced for these labels)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Update existing i18n strings used by Tasks and Overtime to remove '(optional)' wording (tasks.completionComment, tasks.beforePhoto, tasks.afterPhoto, overtime.comment) while keeping the underlying fields optional; ensure changes are in English at minimum and remain key-driven."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Simplify branding so only “FitGebit” appears next to/under the logo in header and login screen, with title from i18n.",
      "acceptanceCriteria": [
        "AppHeader shows only the single title text “FitGebit” and does not render any subtitle/secondary line.",
        "LoginScreen shows only the single title text “FitGebit” and does not render any subtitle/secondary line.",
        "The displayed title is driven from i18n (update the English translation for app.title to “FitGebit”)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppHeader.tsx",
          "operation": "modify",
          "description": "Remove the subtitle/secondary branding text rendering near the logo so the header shows only the app title from i18n."
        },
        {
          "path": "frontend/src/components/auth/LoginScreen.tsx",
          "operation": "modify",
          "description": "Remove the subtitle/secondary branding text under the title so the login screen shows only the app title from i18n."
        },
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Update the English translation for app.title to exactly “FitGebit” (keeping title i18n-driven)."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Fix avatar picker rendering so all 16 existing dental avatars display reliably, and ensure empty-state text is i18n-driven.",
      "acceptanceCriteria": [
        "AvatarPicker renders an SVG image for each avatar returned by getAllDentalAvatars; grid items are not blank and do not show the '?' fallback when avatar data is present.",
        "If avatars cannot be loaded or the list is empty, the empty-state message is translated via i18n (no hard-coded 'No avatars available' text).",
        "No changes increase the avatar count beyond the existing 16."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/avatars/DentalAvatarImage.tsx",
          "operation": "modify",
          "description": "Improve SVG rendering reliability by rendering avatar.svg in a way that respects sizing/styling (e.g., as an <img> using a data URI) so grid cells do not appear blank when svg data exists; keep the existing fallback only for truly missing avatar data."
        },
        {
          "path": "frontend/src/components/avatars/AvatarPicker.tsx",
          "operation": "modify",
          "description": "Replace the hard-coded empty-state string with an i18n translation key, and wire the component to use the i18n hook for that message."
        },
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add/adjust an i18n key for the avatar picker empty state (English text) and use it from AvatarPicker; ensure no avatar-count changes are introduced (still the existing 16 from backend)."
        }
      ]
    }
  ]
}