{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Task completion dialog subtitle + per-task reset button for assistants",
  "requirements": [
    {
      "id": "REQ-63",
      "summary": "Show the selected task title as a smaller subtitle line in the task completion (mark-done) dialog.",
      "acceptanceCriteria": [
        "When the completion dialog is opened from any task card, the dialog shows the selected task’s title in the dialog content/header area as a smaller subtitle-style element (not as the main dialog title).",
        "The displayed title matches the task title shown on the task card (no truncation beyond existing UI constraints, no mismatched task).",
        "The completion dialog remains fully opaque in both light and dark mode (no see-through background regression)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/tasks/CompleteTaskDialog.tsx",
          "operation": "modify",
          "description": "Render the current task.title in the dialog header/content as a smaller subtitle-style line beneath the existing dialog title while keeping the DialogContent background fully opaque in light/dark mode."
        },
        {
          "path": "frontend/src/components/tasks/TaskCard.tsx",
          "operation": "modify",
          "description": "Ensure the completion dialog continues to be opened with the correct task instance so the subtitle always reflects the same task title shown on the card."
        }
      ]
    },
    {
      "id": "REQ-64",
      "summary": "Add a visible per-task reset control for Assistants on completed task cards that calls the existing resetTask mutation and updates the list state after success.",
      "acceptanceCriteria": [
        "For a completed task, Assistants can see a reset control on the task card without needing to open any other screen.",
        "Clicking the reset control triggers the existing frontend resetTask flow (via the current hooks) and, after success, the task displays as not completed in the list.",
        "The reset control is not hidden for Assistants (based on role) anywhere the task list is displayed.",
        "Any new user-facing label(s) introduced for this reset action use the i18n system and have English text present (e.g., a key like tasks.resetTask)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/translations.ts",
          "operation": "modify",
          "description": "Add a new i18n key for the reset action label (e.g., tasks.resetTask) with English text present, and wire it into existing translation dictionaries."
        },
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Fetch the caller user profile and derive an isAssistant flag (based on ProfileRole) to pass down to the task list so the reset control is available to all Assistants wherever the task list is rendered on this page."
        },
        {
          "path": "frontend/src/components/tasks/TaskList.tsx",
          "operation": "modify",
          "description": "Extend TaskList props to accept an Assistant capability flag (e.g., canResetTasks) and pass it through to each TaskCard so completed tasks can expose the reset control consistently."
        },
        {
          "path": "frontend/src/components/tasks/TaskCard.tsx",
          "operation": "modify",
          "description": "Use the existing useResetTask hook to add a clearly visible reset button on completed task cards when the caller is an Assistant; label the control via i18n and keep existing React Query caching behavior (invalidateQueries/placeholderData) intact so the task re-renders as not completed after reset succeeds."
        }
      ]
    }
  ]
}